app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    if  @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "hey! all is good!"], ["commenter", "first comment"], ["created_at", "2014-10-27 12:23:51.740408"], ["updated_at", "2014-10-27 12:23:51.740408"]]